Revit 2027 API
ParameterDownloadOptions(ISet<ElementId>, Boolean, Boolean, ForgeTypeId) Constructor
 Creates a new ParameterDownloadOptions instance. Category bindings are represented by an ElementIdSet populated with category identifiers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ParameterDownloadOptions(
	ISet<ElementId> categories,
	bool isInstance,
	bool visible,
	ForgeTypeId groupTypeId
)
Public Sub New (
	categories As ISet(Of ElementId),
	isInstance As Boolean,
	visible As Boolean,
	groupTypeId As ForgeTypeId
)
public:
ParameterDownloadOptions(
	ISet<ElementId^>^ categories,
	bool isInstance,
	bool visible,
	ForgeTypeId^ groupTypeId
)
new :
        categories : ISet<ElementId> *
        isInstance : bool *
        visible : bool *
        groupTypeId : ForgeTypeId -> ParameterDownloadOptions
Parameters
categories ISet<ElementId>
 The category identifiers.
isInstance Boolean
 True if binding to Element instances, false if binding to Element types.
visible Boolean
 True if the parameter is visible to the user, false if it is hidden and accessible only via the API.
groupTypeId ForgeTypeId
 Properties palette group identifier.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterDownloadOptions Class
ParameterDownloadOptions Overload
Autodesk.Revit.DB Namespace